Repository: Christopher-Melendez/jackson
Catalog: src/jackson/index/locale/*/LC_MESSAGES/django.po
Languages: es

source: Name
es: Nombre

source: Email
es: Correo Electrónico

source: Phone Number
es: Número de Teléfono

source: Let us know how we can help!
es: ¡Cuéntenos cómo podemos ayudarlo!

source: Message
es: Mensaje

source: Eye Doctor and Opticians Serving Jackson Heights for Over Three Decades
es: Oculisto y Ópticos que Sirven a Jackson Heights por Más de Tres Décadas

source: About Us
es: Acerca de Nosotros

source: Lens Lab Express has been helping patients look and see their best for over three decades now! We're a small latina woman owned business that takes pride in delivering excellent patient experiences. We make sure that our exceptional doctor leaves you seeing the best, and our amazing opticians leave you looking your best!
es: Lens Lab Express ha estado ayudando a nuestros pacientes ver y sentirse lo mejor posible por más de tres décadas. Somos un pequeño negocio operado por mujeres latinas que se enorgullece de ofrecer excelentes experiencias para nuestros pacientes. Nos aseguramos de que nuestro doctor le deje viendo lo mejor y nuestros ópticos le dejen luciendo lo mejor posible.

source: Meet the team today and schedule your eye exam with us!
es: ¡Conozca al equipo hoy y programe su examen de la vista con nosotros!

source: Make an Appointment
es: Haga una Cita

source: Our Services
es: Nuestros Servicios

source: Comprehensive Eye Examinations
es: Exámenes Oculares Completos

source: Regular eye exams are a cornerstone of maintaining vibrant, healthy eyes, essential for both adults and children. Some conditions progress silently, causing no discomfort or vision impairment. Early detection is our focus, reducing risks and broadening treatment choices. Our comprehensive exams encompass a range of assessments, including: <ul> <li>Optical Coherence Tomography</li> <li>Visual Field Test</li> <li>Fundus Photo Exam</li> <li>B-Scan</li> <li>Pachymetry</li> <li>Dilation</li> <li>Exterior Photos of the Eye</li> <li>Slit lamp examination</li> <li>Refraction for glasses and contact lenses</li> <li>Glaucoma pressure testing</li> <li>Diabetic evaluations</li> <li>Series of advanced computerized tests for a comprehensive evaluation of eye health.</li> </ul>
es: Los exámenes regulares de la vista son fundamentales para mantener ojos vibrantes y saludables, esenciales tanto para adultos como para niños. Algunas condiciones progresan silenciosamente, sin causar molestias o deterioro de la visión. La detección temprana es nuestro enfoque, reduciendo riesgos y ampliando las opciones de tratamiento. Nuestros exámenes completos abarcan una gama de evaluaciones, incluyendo: <ul> <li>Tomografía de Coherencia Óptica</li> <li>Prueba del Campo Visual</li> <li>Examen Fotográfico del Fondo del Ojo</li> <li>Ecografía Ocular (B-Scan)</li> <li>Paquimetría</li> <li>Dilatación de la Pupila</li> <li>Fotografías Exteriores del Ojo</li> <li>Examen Biomicroscópico (Lámpara de Hendidura)</li> <li>Refracción para anteojos y lentes de contacto</li> <li>Prueba de Presión Ocular para Glaucoma</li> <li>Evaluaciones Diabéticas</li> <li>Serie de pruebas computarizadas avanzadas para una evaluación completa de la salud ocular.</li> </ul>

source: Contact Lens Exam and Fittings
es: Examen y Adaptación de Lentes de Contacto

source: Thanks to remarkable advances in optical technology, contact lenses are now a versatile option for almost everyone. This includes those with astigmatism and those seeking multifocal lenses. We provide a comprehensive selection of contact lenses, including daily disposables, extended-wear soft lenses, and gas permeable contacts.
es: Gracias a los notables avances en tecnología óptica, los lentes de contacto son ahora una opción versátil para casi todos. Esto incluye a aquellos con astigmatismo y aquellos que buscan lentes multifocales. Ofrecemos una selección completa de lentes de contacto, incluyendo desechables diarios, lentes de uso prolongado y lentes de contacto permeables al gas.

source: Optical Fitting, Adjusting, and Repairs
es: Ajuste y Reparación de Anteojos

source: Our optical specialists at Lens Lab Express are committed to helping every patient discover eyewear that harmonizes with their unique style and lifestyle. We're well-versed in the latest lens technologies and adept at merging your lifestyle with lens tech to create eyewear that is truly individual. Explore our diverse selection of styles to satisfy your personal taste.
es: Nuestros especialistas ópticos en Lens Lab Express están comprometidos a ayudar a cada paciente a descubrir anteojos que armonicen con su estilo de vida único. Estamos bien versados en las últimas tecnologías de lentes y hábiles en combinar su estilo de vida con la tecnología de lentes para crear anteojos que sean verdaderamente individuales. Explore nuestra diversa selección de estilos para satisfacer su gusto personal.

source: Repairs and Adjustments
es: Reparaciones y Ajustes

source: At Lens Lab Express, we understand that things happen. Our highly trained opticians are here to help. We offer adjustments for your eyeglasses whenever they feel uncomfortable or ill-fitting. Stop by at any time, and we'll ensure your glasses are cleaned, smudge-free, and providing clear vision. If your frames, nose pads, temples, or screws need repair, we've got you covered.
es: En Lens Lab Express, entendemos que las cosas suceden. Nuestros ópticos altamente capacitados están aquí para ayudar. Ofrecemos ajustes para sus anteojos siempre que se sientan incomodos o mal ajustados. Pase por aquí en cualquier momento, y nos aseguraremos de que sus anteojos estén limpios, sin manchas y proporcionando una visión clara. Si sus monturas, almohadillas nasales, varillas o tornillos necesitan reparación, nosotros lo tenemos cubierto.

source: Optical 1 Hour Service
es: Servicio Óptico de 1 Hora

source: When you need new glasses, you shouldn't have to wait. Experience the convenience of our Optical 1 Hour Service, available for most prescriptions, ensuring you'll have your glasses made while you wait.
es: Cuando necesite anteojos nuevos, no debería tener que esperar. Disfruta la conveniencia de nuestro Servicio Óptico de 1 Hora disponible para la mayoría de las recetas, asegurando que tendrá sus anteojos hechos mientras espera.

source: Contact Us
es: Contáctenos

source: Your message has been received! Give us 24-48 hours to get back to you. If you think we're taking too long, don't hesitate to <a href="tel:7184783539">call</a> our office for any questions or for appointments.
es: ¡Su mensaje ha sido recibido! Permítanos 24-48 horas para responderle. Si piensa que estamos tardando demasiado, no dude en <a href="tel:7184783539">llamar</a> a nuestra oficina para cualquier pregunta o para hacer citas.

source: Eyecare Library
es: Biblioteca Ocular

source: Find answers to your questions on contact lens care, glasses options, cataracts and more!
es: Encuentre respuestas a sus preguntas sobre el cuidado de lentes de contacto, opciones de gafas, cataratas y más!

source: Check back every month for our latest release!
es: ¡Mira nuestras ofertas más recientes!

source: Categories:
es: Categorías

source: Lens Lab Express in Jackson Heights, Queens has been offering the best in eyewear, contact lenses, and eye exams for over a decade.
es: Lens Lab Express en Jackson Heights, Queens ha estado ofreciendo lo mejor en gafas, lentes de contacto y exámenes de la vista durante más de una década.

source: Home
es: Inicio

source: Promotions
es: Promociones

source: Our Hours
es: Nuestras Horas

source: Monday
es: Lunes

source: Tuesday
es: Martes

source: Wednesday
es: Miércoles

source: Thursday
es: Jueves

source: Friday
es: Viernes

source: Saturday
es: Sábado

source: Sunday
es: Domingo

source: Optical & Eye Doctor in Jackson Heights, Queens
es: Óptica y Doctor De Ojos en Jackson Heights, Queens

source: Eyeglasses, Eye Exams & Contact Lenses
es: Gafas, Exámenes Oculares y Lentes De Contacto

source: At Lens Lab Express, we pride ourselves with a wide variety of designer frames across various price points. Additionally, we offer swift one-hour or next-day service for most prescriptions. Our doctors perform precision contact lens fittings for sphere, astigmatic, and multifocal contact lens wearers. Our Commitment to comprehensive eyecare extends to annual diabetic eye examinations, thorough glaucoma screenings, dry eye management, and a range of medical treatments to ensure your ocular health is in expert hands.
es: En Lens Lab Express, ofrecemos un gran variedad de monturas y gafas de diseñador en diferentes rangos de precios. Además, ofrecemos un servicio rapído de una hora o al día siguente para la mayoríá de recetas. Nuestros doctores realizan lo mejor y más nueva atención en lentes de contactos para usarios de esféricosastigmáticos y multifocales. Nuestro equipo de doctores expertos controla toda su salud ocular, desde exámenes de detección de glaucoma, control del ojo seco, casos de conjuntivitis y una variedad de tratamientos médicos para garantizar que su salud ocular esté en manos expertas.

source: Blurry Vision Checks
es: Chequeos de Visión Borrosa

source: Diabetes & Glaucoma Screenings
es: Exámenes de Diabetes y Glaucoma

source: Medical Eye Care
es: Cuidado Médico de los Ojos

source: Our Brands
es: Nuestras Marcas

source: View More Brands
es: Ver Más Marcas

source: Accepeted Insurances
es: Seguros Aceptados

source: We also accept <strong>FSA</strong> plans (Flex Spending Accounts) and <strong>HSA</strong> plans (Health Spending Accounts)
es: También aceptamos planes <strong>FSA</strong> (Cuentas de Gastos Flexibles) y planes <strong>HSA</strong> (Cuentas de Gastos de Salud)

source: If your plan is not mentioned, please call us and ask because we may accept it.
es: Si su plan no está mencionado, por favor llámenos y pregunte porque podríamos aceptarlo.

source: What Our Patients Say
es: Lo Que Dicen Nuestros Pacientes

source: Posted on
es: Publicado en

source: Eyeing Some New Eyewear?
es: ¿Buscando Nuevos Anteojos?

source: Drop your email and get
es: Deja su correo electrónico y obtén

source: Your next order with us!
es: Su próximo pedido con nosotros!

source: Enter Email Address
es: Pone Correo Electrónico

source: Get Now
es: Obtén Ahora

source: Thanks for joining us!
es: ¡Gracias por unirte a nosotros!

source: Please present this code
es: Por favor presenta este código

source: Either in store, or online (coming soon) to get 10%% off your next purchase!
es: ¡Ya sea en la tienda o en línea (próximamente) para obtener un 10%% de descuento en su próxima compra!

source: Previous
es: Anterior

source: Page
es: Página

source: of
es: de

source: Next
es: Siguente

source: Promotional Offers on Eyewear
es: Ofertas Promocionales en anteojos

source: Special Promotions
es: Promociones

source: Check out our latest offers!
es: ¡Mira nuestras ofertas más recientes!

source: OFFER EXPIRED
es: OFERTA CADUCADA

source: Offer Expires:
es: Oferta Vence el:
